### Questions for Part 2: Data Manipulation with Pandas





7. What is the output of `df['Name']` given the provided DataFrame example?
8. How would you select rows where the 'City' is 'New York'?
9. What function can be used to count the number of non-NA/null values in a column?
10. How can you filter rows in a DataFrame where 'Age' is less than 30?
11. How do you aggregate data in Pandas?
12. What is the result of `df['Age'].sum()` given the provided DataFrame example?
13. How can you rename a column in a DataFrame?
14. How do you select multiple columns from a DataFrame?
15. How would you filter rows based on multiple conditions, e.g., 'Age' greater than 25 and 'City' is 'San Francisco'?
16. What is the purpose of the `mean()` function in Pandas?
17. How can you delete a column from a DataFrame?
18. How do you access the last row of a DataFrame?
19. How can you reset the index of a DataFrame?
20. How would you group data in a DataFrame based on a specific column?
21. How can you sort a DataFrame based on a specific column?
22. What is the difference between `loc` and `iloc` in Pandas?
23. How do you set a specific column as the index of a DataFrame?
24. How can you concatenate two DataFrames vertically?
25. How would you apply a custom function to a column in a DataFrame?

1. What are the primary functions of Pandas?

Pandas primary functions are data manipulation and analysis through the use of two powerful data structures: Series and DataFrame.

2. How can you select a specific column from a DataFrame?

In [1]:
import pandas as pd

df = pd.read_csv('/workspaces/DScourse/CourseMaterials/Data/sberbank_russian_housing_market/macro.csv')

df.head(3)

,timestamp,oil_urals,gdp_quart,gdp_quart_growth,cpi,ppi,gdp_deflator,balance_trade,balance_trade_growth,usdrub,...,provision_retail_space_modern_sqm,turnover_catering_per_cap,theaters_viewers_per_1000_cap,seats_theather_rfmin_per_100000_cap,museum_visitis_per_100_cap,bandwidth_sports,population_reg_sports_share,students_reg_sports_share,apartment_build,apartment_fund_sqm
0,2010-01-01,76.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,690.0,6221.0,527.0,0.41,993.0,NaN,NaN,63.03,22825.0,NaN
1,2010-01-02,76.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,690.0,6221.0,527.0,0.41,993.0,NaN,NaN,63.03,22825.0,NaN
2,2010-01-03,76.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,690.0,6221.0,527.0,0.41,993.0,NaN,NaN,63.03,22825.0,NaN

In [2]:
df['apartment_build']

0       22825.0
1       22825.0
2       22825.0
3       22825.0
4       22825.0
         ...
2479        NaN
2480        NaN
2481        NaN
2482        NaN
2483        NaN
Name: apartment_build, Length: 2484, dtype: float64

3. How would you select rows from a DataFrame based on a condition?

In [3]:
df[df['oil_urals'] > 76.1]

,timestamp,oil_urals,gdp_quart,gdp_quart_growth,cpi,ppi,gdp_deflator,balance_trade,balance_trade_growth,usdrub,...,provision_retail_space_modern_sqm,turnover_catering_per_cap,theaters_viewers_per_1000_cap,seats_theather_rfmin_per_100000_cap,museum_visitis_per_100_cap,bandwidth_sports,population_reg_sports_share,students_reg_sports_share,apartment_build,apartment_fund_sqm
59,2010-03-01,77.0300,NaN,NaN,317.7,343.9,NaN,16.704,NaN,29.9635,...,690.0,6221.0,527.0,0.41000,993.0,NaN,NaN,63.03,22825.0,NaN
60,2010-03-02,77.0300,NaN,NaN,317.7,343.9,NaN,16.704,NaN,29.8530,...,690.0,6221.0,527.0,0.41000,993.0,NaN,NaN,63.03,22825.0,NaN
61,2010-03-03,77.0300,NaN,NaN,317.7,343.9,NaN,16.704,NaN,29.7630,...,690.0,6221.0,527.0,0.41000,993.0,NaN,NaN,63.03,22825.0,NaN
62,2010-03-04,77.0300,NaN,NaN,317.7,343.9,NaN,16.704,NaN,29.8660,...,690.0,6221.0,527.0,0.41000,993.0,NaN,NaN,63.03,22825.0,NaN
63,2010-03-05,77.0300,NaN,NaN,317.7,343.9,NaN,16.704,NaN,29.7916,...,690.0,6221.0,527.0,0.41000,993.0,NaN,NaN,63.03,22825.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1790,2014-11-26,78.9665,20406.9,0.9,434.9,512.5,113.465,16.540,7.2,47.0581,...,NaN,10311.0,NaN,0.44784,NaN,398451.0,28.2,NaN,46080.0,229294.8
1791,2014-11-27,78.9665,20406.9,0.9,434.9,512.5,113.465,16.540,7.2,48.5826,...,NaN,10311.0,NaN,0.44784,NaN,398451.0,28.2,NaN,46080.0,229294.8
1792,2014-11-28,78.9665,20406.9,0.9,434.9,512.5,113.465,16.540,7.2,49.4670,...,NaN,10311.0,NaN,0.44784,NaN,398451.0,28.2,NaN,46080.0,229294.8
1793,2014-11-29,78.9665,20406.9,0.9,434.9,512.5,113.465,16.540,7.2,49.4670,...,NaN,10311.0,NaN,0.44784,NaN,398451.0,28.2,NaN,46080.0,229294.8
1794,2014-11-30,78.9665,20406.9,0.9,434.9,512.5,113.465,16.540,7.2,49.4670,...,NaN,10311.0,NaN,0.44784,NaN,398451.0,28.2,NaN,46080.0,229294.8

4. What function would you use to calculate the average of a column in a DataFrame?

In [4]:
df['oil_urals'].mean()

86.46715680354266

5. How can you add a new column to an existing DataFrame?

In [15]:
people = [{'name': 'John', 'age': 26, 'city': 'New York', 'occupation': 'policeman'},
          {'name': 'Bob','age': 45, 'city': 'Los Angeles', 'occupation': 'clerk'},
          {'name':'Jane','age': 67, 'city': 'Boston', 'occupation': 'company CEO'},
          {'name': 'Luke', 'age': 19, 'city': 'New York', 'occupation': 'lifeguard'},
          {'name': 'Amanda', 'age': 55, 'city': 'Boston', 'occupation': 'businesswoman'}
          ]
my_df = pd.DataFrame(people, index=[1, 2, 3, 4, 5])
my_df

     name  age         city     occupation
1    John   26     New York      policeman
2     Bob   45  Los Angeles          clerk
3    Jane   67       Boston    company CEO
4    Luke   19     New York      lifeguard
5  Amanda   55       Boston  businesswoman

In [61]:
genders = ['male', 'male', 'female', 'male', 'female']
my_df['gender'] = genders
my_df[['name', 'age', 'gender', 'occupation', 'city']]

     name  age  gender     occupation         city
1    John   26    male      policeman     New York
2     Bob   45    male          clerk  Los Angeles
3    Jane   67  female    company CEO       Boston
4    Luke   19    male      lifeguard     New York
5  Amanda   55  female  businesswoman       Boston

In [62]:
del my_df['gender']

In [63]:
my_df.insert(2, column='gender', value=genders)
my_df

     name  age  gender         city     occupation
1    John   26    male     New York      policeman
2     Bob   45    male  Los Angeles          clerk
3    Jane   67  female       Boston    company CEO
4    Luke   19    male     New York      lifeguard
5  Amanda   55  female       Boston  businesswoman

In [64]:
# assign method returns a new DataFrame object!
my_df.assign(gender=genders)
my_df[['name', 'age', 'gender', 'occupation', 'city']]

     name  age  gender     occupation         city
1    John   26    male      policeman     New York
2     Bob   45    male          clerk  Los Angeles
3    Jane   67  female    company CEO       Boston
4    Luke   19    male      lifeguard     New York
5  Amanda   55  female  businesswoman       Boston

6. How do you modify the values of an existing column in a DataFrame?